#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bemerkenswert/jappuccini-github-org/runs/run-LDqHnnPKkcma2Ast

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
github_membership.membership_for_steffenlm: Refreshing state... [id=jappuccini:SteffenLm]
github_membership.membership_for_appenmaier: Refreshing state... [id=jappuccini:appenmaier]
github_repository.java-exercises: Refreshing state... [id=java-exercises]
github_repository.java-exams: Refreshing state... [id=java-exams]
github_repository.github-organization: Refreshing state... [id=github-organization]
github_repository.java-docs: Refreshing state... [id=java-docs]
github_repository.java-docs: Drift detected (update)
github_repository.java-exercises: Drift detected (update)
github_repository.github-organization: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.java-demos will be created
  + resource "github_repository" "java-demos" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "The java demos represented as code. Everything as Code ❤️"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "Java"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "java-demos"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "demo",
          + "google-java-format",
          + "java",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @SteffenLm, Action: `pull_request`*